yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_pio1.h
/* Register offsets *********************************************************/

#define RP2040_PIO1_CTRL_OFFSET               0x000000  /* PIO control register */
#define RP2040_PIO1_FSTAT_OFFSET              0x000004  /* FIFO status register */
#define RP2040_PIO1_FDEBUG_OFFSET             0x000008  /* FIFO debug register */
#define RP2040_PIO1_FLEVEL_OFFSET             0x00000c  /* FIFO levels */
#define RP2040_PIO1_TXF0_OFFSET               0x000010  /* Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. */
#define RP2040_PIO1_TXF1_OFFSET               0x000014  /* Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. */
#define RP2040_PIO1_TXF2_OFFSET               0x000018  /* Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. */
#define RP2040_PIO1_TXF3_OFFSET               0x00001c  /* Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. */
#define RP2040_PIO1_RXF0_OFFSET               0x000020  /* Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. */
#define RP2040_PIO1_RXF1_OFFSET               0x000024  /* Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. */
#define RP2040_PIO1_RXF2_OFFSET               0x000028  /* Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. */
#define RP2040_PIO1_RXF3_OFFSET               0x00002c  /* Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. */
#define RP2040_PIO1_IRQ_OFFSET                0x000030  /* Interrupt request register. Write 1 to clear */
#define RP2040_PIO1_IRQ_FORCE_OFFSET          0x000034  /* Writing a 1 to each of these bits will forcibly assert the corresponding IRQ. Note this is different to the INTF register: writing here affects PIO internal state. INTF just asserts the processor-facing IRQ signal for testing ISRs, and is not visible to the state machines. */
#define RP2040_PIO1_INPUT_SYNC_BYPASS_OFFSET  0x000038  /* There is a 2-flipflop synchronizer on each GPIO input, which protects PIO logic from metastabilities. This increases input delay, and for fast synchronous IO (e.g. SPI) these synchronizers may need to be bypassed. Each bit in this register corresponds to one GPIO. 0 -> input is synchronized (default) 1 -> synchronizer is bypassed If in doubt, leave this register as all zeroes. */
#define RP2040_PIO1_DBG_PADOUT_OFFSET         0x00003c  /* Read to sample the pad output values PIO is currently driving to the GPIOs. */
#define RP2040_PIO1_DBG_PADOE_OFFSET          0x000040  /* Read to sample the pad output enables (direction) PIO is currently driving to the GPIOs. */
#define RP2040_PIO1_DBG_CFGINFO_OFFSET        0x000044  /* The PIO hardware has some free parameters that may vary between chip products. These should be provided in the chip datasheet, but are also exposed here. */
#define RP2040_PIO1_INSTR_MEM0_OFFSET         0x000048  /* Write-only access to instruction memory location 0 */
#define RP2040_PIO1_INSTR_MEM1_OFFSET         0x00004c  /* Write-only access to instruction memory location 1 */
#define RP2040_PIO1_INSTR_MEM2_OFFSET         0x000050  /* Write-only access to instruction memory location 2 */
#define RP2040_PIO1_INSTR_MEM3_OFFSET         0x000054  /* Write-only access to instruction memory location 3 */
#define RP2040_PIO1_INSTR_MEM4_OFFSET         0x000058  /* Write-only access to instruction memory location 4 */
#define RP2040_PIO1_INSTR_MEM5_OFFSET         0x00005c  /* Write-only access to instruction memory location 5 */
#define RP2040_PIO1_INSTR_MEM6_OFFSET         0x000060  /* Write-only access to instruction memory location 6 */
#define RP2040_PIO1_INSTR_MEM7_OFFSET         0x000064  /* Write-only access to instruction memory location 7 */
#define RP2040_PIO1_INSTR_MEM8_OFFSET         0x000068  /* Write-only access to instruction memory location 8 */
#define RP2040_PIO1_INSTR_MEM9_OFFSET         0x00006c  /* Write-only access to instruction memory location 9 */
#define RP2040_PIO1_INSTR_MEM10_OFFSET        0x000070  /* Write-only access to instruction memory location 10 */
#define RP2040_PIO1_INSTR_MEM11_OFFSET        0x000074  /* Write-only access to instruction memory location 11 */
#define RP2040_PIO1_INSTR_MEM12_OFFSET        0x000078  /* Write-only access to instruction memory location 12 */
#define RP2040_PIO1_INSTR_MEM13_OFFSET        0x00007c  /* Write-only access to instruction memory location 13 */
#define RP2040_PIO1_INSTR_MEM14_OFFSET        0x000080  /* Write-only access to instruction memory location 14 */
#define RP2040_PIO1_INSTR_MEM15_OFFSET        0x000084  /* Write-only access to instruction memory location 15 */
#define RP2040_PIO1_INSTR_MEM16_OFFSET        0x000088  /* Write-only access to instruction memory location 16 */
#define RP2040_PIO1_INSTR_MEM17_OFFSET        0x00008c  /* Write-only access to instruction memory location 17 */
#define RP2040_PIO1_INSTR_MEM18_OFFSET        0x000090  /* Write-only access to instruction memory location 18 */
#define RP2040_PIO1_INSTR_MEM19_OFFSET        0x000094  /* Write-only access to instruction memory location 19 */
#define RP2040_PIO1_INSTR_MEM20_OFFSET        0x000098  /* Write-only access to instruction memory location 20 */
#define RP2040_PIO1_INSTR_MEM21_OFFSET        0x00009c  /* Write-only access to instruction memory location 21 */
#define RP2040_PIO1_INSTR_MEM22_OFFSET        0x0000a0  /* Write-only access to instruction memory location 22 */
#define RP2040_PIO1_INSTR_MEM23_OFFSET        0x0000a4  /* Write-only access to instruction memory location 23 */
#define RP2040_PIO1_INSTR_MEM24_OFFSET        0x0000a8  /* Write-only access to instruction memory location 24 */
#define RP2040_PIO1_INSTR_MEM25_OFFSET        0x0000ac  /* Write-only access to instruction memory location 25 */
#define RP2040_PIO1_INSTR_MEM26_OFFSET        0x0000b0  /* Write-only access to instruction memory location 26 */
#define RP2040_PIO1_INSTR_MEM27_OFFSET        0x0000b4  /* Write-only access to instruction memory location 27 */
#define RP2040_PIO1_INSTR_MEM28_OFFSET        0x0000b8  /* Write-only access to instruction memory location 28 */
#define RP2040_PIO1_INSTR_MEM29_OFFSET        0x0000bc  /* Write-only access to instruction memory location 29 */
#define RP2040_PIO1_INSTR_MEM30_OFFSET        0x0000c0  /* Write-only access to instruction memory location 30 */
#define RP2040_PIO1_INSTR_MEM31_OFFSET        0x0000c4  /* Write-only access to instruction memory location 31 */
#define RP2040_PIO1_SM0_CLKDIV_OFFSET         0x0000c8  /* Clock divider register for state machine 0 Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256) */
#define RP2040_PIO1_SM0_EXECCTRL_OFFSET       0x0000cc  /* Execution/behavioural settings for state machine 0 */
#define RP2040_PIO1_SM0_SHIFTCTRL_OFFSET      0x0000d0  /* Control behaviour of the input/output shift registers for state machine 0 */
#define RP2040_PIO1_SM0_ADDR_OFFSET           0x0000d4  /* Current instruction address of state machine 0 */
#define RP2040_PIO1_SM0_INSTR_OFFSET          0x0000d8  /* Instruction currently being executed by state machine 0 Write to execute an instruction immediately (including jumps) and then resume execution. */
#define RP2040_PIO1_SM0_PINCTRL_OFFSET        0x0000dc  /* State machine pin control */
#define RP2040_PIO1_SM1_CLKDIV_OFFSET         0x0000e0  /* Clock divider register for state machine 1 Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256) */
#define RP2040_PIO1_SM1_EXECCTRL_OFFSET       0x0000e4  /* Execution/behavioural settings for state machine 1 */
#define RP2040_PIO1_SM1_SHIFTCTRL_OFFSET      0x0000e8  /* Control behaviour of the input/output shift registers for state machine 1 */
#define RP2040_PIO1_SM1_ADDR_OFFSET           0x0000ec  /* Current instruction address of state machine 1 */
#define RP2040_PIO1_SM1_INSTR_OFFSET          0x0000f0  /* Instruction currently being executed by state machine 1 Write to execute an instruction immediately (including jumps) and then resume execution. */
#define RP2040_PIO1_SM1_PINCTRL_OFFSET        0x0000f4  /* State machine pin control */
#define RP2040_PIO1_SM2_CLKDIV_OFFSET         0x0000f8  /* Clock divider register for state machine 2 Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256) */
#define RP2040_PIO1_SM2_EXECCTRL_OFFSET       0x0000fc  /* Execution/behavioural settings for state machine 2 */
#define RP2040_PIO1_SM2_SHIFTCTRL_OFFSET      0x000100  /* Control behaviour of the input/output shift registers for state machine 2 */
#define RP2040_PIO1_SM2_ADDR_OFFSET           0x000104  /* Current instruction address of state machine 2 */
#define RP2040_PIO1_SM2_INSTR_OFFSET          0x000108  /* Instruction currently being executed by state machine 2 Write to execute an instruction immediately (including jumps) and then resume execution. */
#define RP2040_PIO1_SM2_PINCTRL_OFFSET        0x00010c  /* State machine pin control */
#define RP2040_PIO1_SM3_CLKDIV_OFFSET         0x000110  /* Clock divider register for state machine 3 Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256) */
#define RP2040_PIO1_SM3_EXECCTRL_OFFSET       0x000114  /* Execution/behavioural settings for state machine 3 */
#define RP2040_PIO1_SM3_SHIFTCTRL_OFFSET      0x000118  /* Control behaviour of the input/output shift registers for state machine 3 */
#define RP2040_PIO1_SM3_ADDR_OFFSET           0x00011c  /* Current instruction address of state machine 3 */
#define RP2040_PIO1_SM3_INSTR_OFFSET          0x000120  /* Instruction currently being executed by state machine 3 Write to execute an instruction immediately (including jumps) and then resume execution. */
#define RP2040_PIO1_SM3_PINCTRL_OFFSET        0x000124  /* State machine pin control */
#define RP2040_PIO1_INTR_OFFSET               0x000128  /* Raw Interrupts */
#define RP2040_PIO1_IRQ0_INTE_OFFSET          0x00012c  /* Interrupt Enable for irq0 */
#define RP2040_PIO1_IRQ0_INTF_OFFSET          0x000130  /* Interrupt Force for irq0 */
#define RP2040_PIO1_IRQ0_INTS_OFFSET          0x000134  /* Interrupt status after masking & forcing for irq0 */
#define RP2040_PIO1_IRQ1_INTE_OFFSET          0x000138  /* Interrupt Enable for irq1 */
#define RP2040_PIO1_IRQ1_INTF_OFFSET          0x00013c  /* Interrupt Force for irq1 */
#define RP2040_PIO1_IRQ1_INTS_OFFSET          0x000140  /* Interrupt status after masking & forcing for irq1 */

/* Register definitions *****************************************************/

#define RP2040_PIO1_CTRL               (RP2040_PIO1_BASE + RP2040_PIO1_CTRL_OFFSET)
#define RP2040_PIO1_FSTAT              (RP2040_PIO1_BASE + RP2040_PIO1_FSTAT_OFFSET)
#define RP2040_PIO1_FDEBUG             (RP2040_PIO1_BASE + RP2040_PIO1_FDEBUG_OFFSET)
#define RP2040_PIO1_FLEVEL             (RP2040_PIO1_BASE + RP2040_PIO1_FLEVEL_OFFSET)
#define RP2040_PIO1_TXF0               (RP2040_PIO1_BASE + RP2040_PIO1_TXF0_OFFSET)
#define RP2040_PIO1_TXF1               (RP2040_PIO1_BASE + RP2040_PIO1_TXF1_OFFSET)
#define RP2040_PIO1_TXF2               (RP2040_PIO1_BASE + RP2040_PIO1_TXF2_OFFSET)
#define RP2040_PIO1_TXF3               (RP2040_PIO1_BASE + RP2040_PIO1_TXF3_OFFSET)
#define RP2040_PIO1_RXF0               (RP2040_PIO1_BASE + RP2040_PIO1_RXF0_OFFSET)
#define RP2040_PIO1_RXF1               (RP2040_PIO1_BASE + RP2040_PIO1_RXF1_OFFSET)
#define RP2040_PIO1_RXF2               (RP2040_PIO1_BASE + RP2040_PIO1_RXF2_OFFSET)
#define RP2040_PIO1_RXF3               (RP2040_PIO1_BASE + RP2040_PIO1_RXF3_OFFSET)
#define RP2040_PIO1_IRQ                (RP2040_PIO1_BASE + RP2040_PIO1_IRQ_OFFSET)
#define RP2040_PIO1_IRQ_FORCE          (RP2040_PIO1_BASE + RP2040_PIO1_IRQ_FORCE_OFFSET)
#define RP2040_PIO1_INPUT_SYNC_BYPASS  (RP2040_PIO1_BASE + RP2040_PIO1_INPUT_SYNC_BYPASS_OFFSET)
#define RP2040_PIO1_DBG_PADOUT         (RP2040_PIO1_BASE + RP2040_PIO1_DBG_PADOUT_OFFSET)
#define RP2040_PIO1_DBG_PADOE          (RP2040_PIO1_BASE + RP2040_PIO1_DBG_PADOE_OFFSET)
#define RP2040_PIO1_DBG_CFGINFO        (RP2040_PIO1_BASE + RP2040_PIO1_DBG_CFGINFO_OFFSET)
#define RP2040_PIO1_INSTR_MEM0         (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM0_OFFSET)
#define RP2040_PIO1_INSTR_MEM1         (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM1_OFFSET)
#define RP2040_PIO1_INSTR_MEM2         (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM2_OFFSET)
#define RP2040_PIO1_INSTR_MEM3         (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM3_OFFSET)
#define RP2040_PIO1_INSTR_MEM4         (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM4_OFFSET)
#define RP2040_PIO1_INSTR_MEM5         (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM5_OFFSET)
#define RP2040_PIO1_INSTR_MEM6         (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM6_OFFSET)
#define RP2040_PIO1_INSTR_MEM7         (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM7_OFFSET)
#define RP2040_PIO1_INSTR_MEM8         (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM8_OFFSET)
#define RP2040_PIO1_INSTR_MEM9         (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM9_OFFSET)
#define RP2040_PIO1_INSTR_MEM10        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM10_OFFSET)
#define RP2040_PIO1_INSTR_MEM11        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM11_OFFSET)
#define RP2040_PIO1_INSTR_MEM12        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM12_OFFSET)
#define RP2040_PIO1_INSTR_MEM13        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM13_OFFSET)
#define RP2040_PIO1_INSTR_MEM14        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM14_OFFSET)
#define RP2040_PIO1_INSTR_MEM15        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM15_OFFSET)
#define RP2040_PIO1_INSTR_MEM16        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM16_OFFSET)
#define RP2040_PIO1_INSTR_MEM17        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM17_OFFSET)
#define RP2040_PIO1_INSTR_MEM18        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM18_OFFSET)
#define RP2040_PIO1_INSTR_MEM19        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM19_OFFSET)
#define RP2040_PIO1_INSTR_MEM20        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM20_OFFSET)
#define RP2040_PIO1_INSTR_MEM21        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM21_OFFSET)
#define RP2040_PIO1_INSTR_MEM22        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM22_OFFSET)
#define RP2040_PIO1_INSTR_MEM23        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM23_OFFSET)
#define RP2040_PIO1_INSTR_MEM24        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM24_OFFSET)
#define RP2040_PIO1_INSTR_MEM25        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM25_OFFSET)
#define RP2040_PIO1_INSTR_MEM26        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM26_OFFSET)
#define RP2040_PIO1_INSTR_MEM27        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM27_OFFSET)
#define RP2040_PIO1_INSTR_MEM28        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM28_OFFSET)
#define RP2040_PIO1_INSTR_MEM29        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM29_OFFSET)
#define RP2040_PIO1_INSTR_MEM30        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM30_OFFSET)
#define RP2040_PIO1_INSTR_MEM31        (RP2040_PIO1_BASE + RP2040_PIO1_INSTR_MEM31_OFFSET)
#define RP2040_PIO1_SM0_CLKDIV         (RP2040_PIO1_BASE + RP2040_PIO1_SM0_CLKDIV_OFFSET)
#define RP2040_PIO1_SM0_EXECCTRL       (RP2040_PIO1_BASE + RP2040_PIO1_SM0_EXECCTRL_OFFSET)
#define RP2040_PIO1_SM0_SHIFTCTRL      (RP2040_PIO1_BASE + RP2040_PIO1_SM0_SHIFTCTRL_OFFSET)
#define RP2040_PIO1_SM0_ADDR           (RP2040_PIO1_BASE + RP2040_PIO1_SM0_ADDR_OFFSET)
#define RP2040_PIO1_SM0_INSTR          (RP2040_PIO1_BASE + RP2040_PIO1_SM0_INSTR_OFFSET)
#define RP2040_PIO1_SM0_PINCTRL        (RP2040_PIO1_BASE + RP2040_PIO1_SM0_PINCTRL_OFFSET)
#define RP2040_PIO1_SM1_CLKDIV         (RP2040_PIO1_BASE + RP2040_PIO1_SM1_CLKDIV_OFFSET)
#define RP2040_PIO1_SM1_EXECCTRL       (RP2040_PIO1_BASE + RP2040_PIO1_SM1_EXECCTRL_OFFSET)
#define RP2040_PIO1_SM1_SHIFTCTRL      (RP2040_PIO1_BASE + RP2040_PIO1_SM1_SHIFTCTRL_OFFSET)
#define RP2040_PIO1_SM1_ADDR           (RP2040_PIO1_BASE + RP2040_PIO1_SM1_ADDR_OFFSET)
#define RP2040_PIO1_SM1_INSTR          (RP2040_PIO1_BASE + RP2040_PIO1_SM1_INSTR_OFFSET)
#define RP2040_PIO1_SM1_PINCTRL        (RP2040_PIO1_BASE + RP2040_PIO1_SM1_PINCTRL_OFFSET)
#define RP2040_PIO1_SM2_CLKDIV         (RP2040_PIO1_BASE + RP2040_PIO1_SM2_CLKDIV_OFFSET)
#define RP2040_PIO1_SM2_EXECCTRL       (RP2040_PIO1_BASE + RP2040_PIO1_SM2_EXECCTRL_OFFSET)
#define RP2040_PIO1_SM2_SHIFTCTRL      (RP2040_PIO1_BASE + RP2040_PIO1_SM2_SHIFTCTRL_OFFSET)
#define RP2040_PIO1_SM2_ADDR           (RP2040_PIO1_BASE + RP2040_PIO1_SM2_ADDR_OFFSET)
#define RP2040_PIO1_SM2_INSTR          (RP2040_PIO1_BASE + RP2040_PIO1_SM2_INSTR_OFFSET)
#define RP2040_PIO1_SM2_PINCTRL        (RP2040_PIO1_BASE + RP2040_PIO1_SM2_PINCTRL_OFFSET)
#define RP2040_PIO1_SM3_CLKDIV         (RP2040_PIO1_BASE + RP2040_PIO1_SM3_CLKDIV_OFFSET)
#define RP2040_PIO1_SM3_EXECCTRL       (RP2040_PIO1_BASE + RP2040_PIO1_SM3_EXECCTRL_OFFSET)
#define RP2040_PIO1_SM3_SHIFTCTRL      (RP2040_PIO1_BASE + RP2040_PIO1_SM3_SHIFTCTRL_OFFSET)
#define RP2040_PIO1_SM3_ADDR           (RP2040_PIO1_BASE + RP2040_PIO1_SM3_ADDR_OFFSET)
#define RP2040_PIO1_SM3_INSTR          (RP2040_PIO1_BASE + RP2040_PIO1_SM3_INSTR_OFFSET)
#define RP2040_PIO1_SM3_PINCTRL        (RP2040_PIO1_BASE + RP2040_PIO1_SM3_PINCTRL_OFFSET)
#define RP2040_PIO1_INTR               (RP2040_PIO1_BASE + RP2040_PIO1_INTR_OFFSET)
#define RP2040_PIO1_IRQ0_INTE          (RP2040_PIO1_BASE + RP2040_PIO1_IRQ0_INTE_OFFSET)
#define RP2040_PIO1_IRQ0_INTF          (RP2040_PIO1_BASE + RP2040_PIO1_IRQ0_INTF_OFFSET)
#define RP2040_PIO1_IRQ0_INTS          (RP2040_PIO1_BASE + RP2040_PIO1_IRQ0_INTS_OFFSET)
#define RP2040_PIO1_IRQ1_INTE          (RP2040_PIO1_BASE + RP2040_PIO1_IRQ1_INTE_OFFSET)
#define RP2040_PIO1_IRQ1_INTF          (RP2040_PIO1_BASE + RP2040_PIO1_IRQ1_INTF_OFFSET)
#define RP2040_PIO1_IRQ1_INTS          (RP2040_PIO1_BASE + RP2040_PIO1_IRQ1_INTS_OFFSET)


/* Register bit definitions *************************************************/


#define RP2040_PIO1_CTRL_CLKDIV_RESTART_SHIFT        (8)  /* Force clock dividers to restart their count and clear fractional accumulators. Restart multiple dividers to synchronise them. */
#define RP2040_PIO1_CTRL_CLKDIV_RESTART_MASK         (0x0f << RP2040_PIO1_CTRL_CLKDIV_RESTART_SHIFT)
#define RP2040_PIO1_CTRL_SM_RESTART_SHIFT            (4)  /* Clear internal SM state which is otherwise difficult to access (e.g. shift counters). Self-clearing. */
#define RP2040_PIO1_CTRL_SM_RESTART_MASK             (0x0f << RP2040_PIO1_CTRL_SM_RESTART_SHIFT)
#define RP2040_PIO1_CTRL_SM_ENABLE_MASK              (0x0f)  /* Enable state machine */

#define RP2040_PIO1_FSTAT_TXEMPTY_SHIFT              (24)  /* State machine TX FIFO is empty */
#define RP2040_PIO1_FSTAT_TXEMPTY_MASK               (0x0f << RP2040_PIO1_FSTAT_TXEMPTY_SHIFT)
#define RP2040_PIO1_FSTAT_TXFULL_SHIFT               (16)  /* State machine TX FIFO is full */
#define RP2040_PIO1_FSTAT_TXFULL_MASK                (0x0f << RP2040_PIO1_FSTAT_TXFULL_SHIFT)
#define RP2040_PIO1_FSTAT_RXEMPTY_SHIFT              (8)  /* State machine RX FIFO is empty */
#define RP2040_PIO1_FSTAT_RXEMPTY_MASK               (0x0f << RP2040_PIO1_FSTAT_RXEMPTY_SHIFT)
#define RP2040_PIO1_FSTAT_RXFULL_MASK                (0x0f)  /* State machine RX FIFO is full */

#define RP2040_PIO1_FDEBUG_TXSTALL_SHIFT             (24)  /* State machine has stalled on empty TX FIFO. Write 1 to clear. */
#define RP2040_PIO1_FDEBUG_TXSTALL_MASK              (0x0f << RP2040_PIO1_FDEBUG_TXSTALL_SHIFT)
#define RP2040_PIO1_FDEBUG_TXOVER_SHIFT              (16)  /* TX FIFO overflow has occurred. Write 1 to clear. */
#define RP2040_PIO1_FDEBUG_TXOVER_MASK               (0x0f << RP2040_PIO1_FDEBUG_TXOVER_SHIFT)
#define RP2040_PIO1_FDEBUG_RXUNDER_SHIFT             (8)  /* RX FIFO underflow has occurred. Write 1 to clear. */
#define RP2040_PIO1_FDEBUG_RXUNDER_MASK              (0x0f << RP2040_PIO1_FDEBUG_RXUNDER_SHIFT)
#define RP2040_PIO1_FDEBUG_RXSTALL_MASK              (0x0f)  /* State machine has stalled on full RX FIFO. Write 1 to clear. */

