yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_pio1.h
#define RP2040_PIO1_FLEVEL_RX3_SHIFT                 (28)
#define RP2040_PIO1_FLEVEL_RX3_MASK                  (0x0f << RP2040_PIO1_FLEVEL_RX3_SHIFT)
#define RP2040_PIO1_FLEVEL_TX3_SHIFT                 (24)
#define RP2040_PIO1_FLEVEL_TX3_MASK                  (0x0f << RP2040_PIO1_FLEVEL_TX3_SHIFT)
#define RP2040_PIO1_FLEVEL_RX2_SHIFT                 (20)
#define RP2040_PIO1_FLEVEL_RX2_MASK                  (0x0f << RP2040_PIO1_FLEVEL_RX2_SHIFT)
#define RP2040_PIO1_FLEVEL_TX2_SHIFT                 (16)
#define RP2040_PIO1_FLEVEL_TX2_MASK                  (0x0f << RP2040_PIO1_FLEVEL_TX2_SHIFT)
#define RP2040_PIO1_FLEVEL_RX1_SHIFT                 (12)
#define RP2040_PIO1_FLEVEL_RX1_MASK                  (0x0f << RP2040_PIO1_FLEVEL_RX1_SHIFT)
#define RP2040_PIO1_FLEVEL_TX1_SHIFT                 (8)
#define RP2040_PIO1_FLEVEL_TX1_MASK                  (0x0f << RP2040_PIO1_FLEVEL_TX1_SHIFT)
#define RP2040_PIO1_FLEVEL_RX0_SHIFT                 (4)
#define RP2040_PIO1_FLEVEL_RX0_MASK                  (0x0f << RP2040_PIO1_FLEVEL_RX0_SHIFT)
#define RP2040_PIO1_FLEVEL_TX0_MASK                  (0x0f)

#define RP2040_PIO1_IRQ_MASK                         (0xff)

#define RP2040_PIO1_IRQ_FORCE_MASK                   (0xff)

#define RP2040_PIO1_DBG_CFGINFO_IMEM_SIZE_SHIFT      (16)  /* The size of the instruction memory, measured in units of one instruction */
#define RP2040_PIO1_DBG_CFGINFO_IMEM_SIZE_MASK       (0x3f << RP2040_PIO1_DBG_CFGINFO_IMEM_SIZE_SHIFT)
#define RP2040_PIO1_DBG_CFGINFO_SM_COUNT_SHIFT       (8)  /* The number of state machines this PIO instance is equipped with. */
#define RP2040_PIO1_DBG_CFGINFO_SM_COUNT_MASK        (0x0f << RP2040_PIO1_DBG_CFGINFO_SM_COUNT_SHIFT)
#define RP2040_PIO1_DBG_CFGINFO_FIFO_DEPTH_MASK      (0x3f)  /* The depth of the state machine TX/RX FIFOs, measured in words. Joining fifos via SHIFTCTRL_FJOIN gives one FIFO with double this depth. */

#define RP2040_PIO1_INSTR_MEM0_MASK                  (0xffff)

#define RP2040_PIO1_INSTR_MEM1_MASK                  (0xffff)

#define RP2040_PIO1_INSTR_MEM2_MASK                  (0xffff)

#define RP2040_PIO1_INSTR_MEM3_MASK                  (0xffff)

#define RP2040_PIO1_INSTR_MEM4_MASK                  (0xffff)

#define RP2040_PIO1_INSTR_MEM5_MASK                  (0xffff)

#define RP2040_PIO1_INSTR_MEM6_MASK                  (0xffff)

#define RP2040_PIO1_INSTR_MEM7_MASK                  (0xffff)

#define RP2040_PIO1_INSTR_MEM8_MASK                  (0xffff)

#define RP2040_PIO1_INSTR_MEM9_MASK                  (0xffff)

#define RP2040_PIO1_INSTR_MEM10_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM11_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM12_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM13_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM14_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM15_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM16_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM17_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM18_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM19_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM20_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM21_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM22_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM23_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM24_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM25_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM26_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM27_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM28_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM29_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM30_MASK                 (0xffff)

#define RP2040_PIO1_INSTR_MEM31_MASK                 (0xffff)

#define RP2040_PIO1_SM0_CLKDIV_INT_SHIFT             (16)  /* Effective frequency is sysclk/int. Value of 0 is interpreted as max possible value */
#define RP2040_PIO1_SM0_CLKDIV_INT_MASK              (0xffff << RP2040_PIO1_SM0_CLKDIV_INT_SHIFT)
#define RP2040_PIO1_SM0_CLKDIV_FRAC_SHIFT            (8)  /* Fractional part of clock divider */
#define RP2040_PIO1_SM0_CLKDIV_FRAC_MASK             (0xff << RP2040_PIO1_SM0_CLKDIV_FRAC_SHIFT)

#define RP2040_PIO1_SM0_EXECCTRL_EXEC_STALLED        (1 << 31)  /* An instruction written to SMx_INSTR is stalled, and latched by the state machine. Will clear once the instruction completes. */
#define RP2040_PIO1_SM0_EXECCTRL_SIDE_EN             (1 << 30)  /* If 1, the delay MSB is used as side-set enable, rather than a side-set data bit. This allows instructions to perform side-set optionally, rather than on every instruction. */
#define RP2040_PIO1_SM0_EXECCTRL_SIDE_PINDIR         (1 << 29)  /* Side-set data is asserted to pin OEs instead of pin values */
#define RP2040_PIO1_SM0_EXECCTRL_JMP_PIN_SHIFT       (24)  /* The GPIO number to use as condition for JMP PIN. Unaffected by input mapping. */
#define RP2040_PIO1_SM0_EXECCTRL_JMP_PIN_MASK        (0x1f << RP2040_PIO1_SM0_EXECCTRL_JMP_PIN_SHIFT)
#define RP2040_PIO1_SM0_EXECCTRL_OUT_EN_SEL_SHIFT    (19)  /* Which data bit to use for inline OUT enable */
#define RP2040_PIO1_SM0_EXECCTRL_OUT_EN_SEL_MASK     (0x1f << RP2040_PIO1_SM0_EXECCTRL_OUT_EN_SEL_SHIFT)
#define RP2040_PIO1_SM0_EXECCTRL_INLINE_OUT_EN       (1 << 18)  /* If 1, use a bit of OUT data as an auxiliary write enable When used in conjunction with OUT_STICKY, writes with an enable of 0 will deassert the latest pin write. This can create useful masking/override behaviour due to the priority ordering of state machine pin writes (SM0 < SM1 < ...) */
#define RP2040_PIO1_SM0_EXECCTRL_OUT_STICKY          (1 << 17)  /* Continuously assert the most recent OUT/SET to the pins */
#define RP2040_PIO1_SM0_EXECCTRL_WRAP_TOP_SHIFT      (12)  /* After reaching this address, execution is wrapped to wrap_bottom. If the instruction is a jump, and the jump condition is true, the jump takes priority. */
#define RP2040_PIO1_SM0_EXECCTRL_WRAP_TOP_MASK       (0x1f << RP2040_PIO1_SM0_EXECCTRL_WRAP_TOP_SHIFT)
#define RP2040_PIO1_SM0_EXECCTRL_WRAP_BOTTOM_SHIFT   (7)  /* After reaching wrap_top, execution is wrapped to this address. */
#define RP2040_PIO1_SM0_EXECCTRL_WRAP_BOTTOM_MASK    (0x1f << RP2040_PIO1_SM0_EXECCTRL_WRAP_BOTTOM_SHIFT)
#define RP2040_PIO1_SM0_EXECCTRL_STATUS_SEL          (1 << 4)  /* All-ones if RX FIFO level < N, otherwise all-zeroes */
#define RP2040_PIO1_SM0_EXECCTRL_STATUS_N_MASK       (0x0f)  /* Comparison level for the MOV x, STATUS instruction */

